#### Terraform Plan 📝

<details><summary>Show Plan</summary>

```terraform
[0m[1mgoogle_artifact_registry_repository.shorted: Preparing import... [id=projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted][0m
[0m[1mgoogle_artifact_registry_repository.shorted: Refreshing state... [id=projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted][0m
[0m[1mmodule.short_data_sync.google_storage_bucket.short_selling_data: Preparing import... [id=shorted-short-selling-data][0m
[0m[1mmodule.short_data_sync.google_storage_bucket.short_selling_data: Refreshing state... [id=shorted-short-selling-data][0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  [32m+[0m create[0m
  [33m~[0m update in-place[0m

Terraform will perform the following actions:

[1m  # google_artifact_registry_repository.shorted[0m will be updated in-place
  # [0m(imported from "projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted")
[0m  [33m~[0m[0m resource "google_artifact_registry_repository" "shorted" {
        cleanup_policy_dry_run = false
        create_time            = "2024-03-30T08:49:54.666382Z"
        description            = "Docker images for Shorted services"
        effective_labels       = {
            "environment" = "dev"
            "managed_by"  = "terraform"
        }
        format                 = "DOCKER"
        id                     = "projects/shorted-dev-aba5688f/locations/australia-southeast2/repositories/shorted"
      [33m~[0m[0m labels                 = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
        location               = "australia-southeast2"
        mode                   = "STANDARD_REPOSITORY"
        name                   = "shorted"
        project                = "shorted-dev-aba5688f"
        repository_id          = "shorted"
      [33m~[0m[0m terraform_labels       = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
        }
        update_time            = "2026-02-24T12:04:26.796960Z"
    }

[1m  # google_project_service.required_apis["artifactregistry.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "artifactregistry.googleapis.com"
    }

[1m  # google_project_service.required_apis["cloudscheduler.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "cloudscheduler.googleapis.com"
    }

[1m  # google_project_service.required_apis["compute.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "compute.googleapis.com"
    }

[1m  # google_project_service.required_apis["iam.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "iam.googleapis.com"
    }

[1m  # google_project_service.required_apis["pubsub.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "pubsub.googleapis.com"
    }

[1m  # google_project_service.required_apis["run.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "run.googleapis.com"
    }

[1m  # google_project_service.required_apis["secretmanager.googleapis.com"][0m will be created
[0m  [32m+[0m[0m resource "google_project_service" "required_apis" {
      [32m+[0m[0m disable_on_destroy = false
      [32m+[0m[0m id                 = (known after apply)
      [32m+[0m[0m project            = "shorted-dev-aba5688f"
      [32m+[0m[0m service            = "secretmanager.googleapis.com"
    }

[1m  # time_sleep.wait_for_apis[0m will be created
[0m  [32m+[0m[0m resource "time_sleep" "wait_for_apis" {
      [32m+[0m[0m create_duration = "60s"
      [32m+[0m[0m id              = (known after apply)
    }

[1m  # module.enrichment_processor.google_cloud_run_v2_service.enrichment_processor[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "enrichment_processor" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "enrichment-processor"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = (known after apply)

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/enrichment-processor:pr-73"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT_ID"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "IMAGE_TAG"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENRICHMENT_PUBSUB_TOPIC"
                  [32m+[0m[0m value = "enrichment-jobs"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENRICHMENT_PUBSUB_SUBSCRIPTION"
                  [32m+[0m[0m value = "enrichment-jobs-subscription"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_ADDRESS"
                  [32m+[0m[0m value = "aws-0-ap-southeast-2.pooler.supabase.com:6543"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_DATABASE"
                  [32m+[0m[0m value = "postgres"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_USERNAME"
                  [32m+[0m[0m value = "postgres.xivfykscsdagwsreyqgf"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "APP_STORE_POSTGRES_PASSWORD"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "APP_STORE_POSTGRES_PASSWORD"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "OPENAI_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "OPENAI_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCS_LOGO_BUCKET"
                  [32m+[0m[0m value = "shorted-company-logos"
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 10

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 8080
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = true
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "4"
                      [32m+[0m[0m "memory" = "8Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 15
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 5
              [32m+[0m[0m min_instance_count = 1
            }
        }
    }

[1m  # module.enrichment_processor.google_cloud_run_v2_service_iam_member.enrichment_processor_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "enrichment_processor_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "enrichment-processor"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.enrichment_processor.google_pubsub_subscription.enrichment_jobs[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_subscription" "enrichment_jobs" {
      [32m+[0m[0m ack_deadline_seconds       = 600
      [32m+[0m[0m effective_labels           = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m id                         = (known after apply)
      [32m+[0m[0m labels                     = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m message_retention_duration = "86400s"
      [32m+[0m[0m name                       = "enrichment-jobs-subscription"
      [32m+[0m[0m project                    = "shorted-dev-aba5688f"
      [32m+[0m[0m terraform_labels           = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m topic                      = "enrichment-jobs"
    }

[1m  # module.enrichment_processor.google_pubsub_subscription_iam_member.processor_subscriber[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_subscription_iam_member" "processor_subscriber" {
      [32m+[0m[0m etag         = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m role         = "roles/pubsub.subscriber"
      [32m+[0m[0m subscription = "enrichment-jobs-subscription"
    }

[1m  # module.enrichment_processor.google_pubsub_topic.enrichment_jobs[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_topic" "enrichment_jobs" {
      [32m+[0m[0m effective_labels = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m labels           = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
      [32m+[0m[0m name             = "enrichment-jobs"
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m terraform_labels = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "enrichment-processor"
        }
    }

[1m  # module.enrichment_processor.google_secret_manager_secret_iam_member.openai_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "openai_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "OPENAI_API_KEY"
    }

[1m  # module.enrichment_processor.google_secret_manager_secret_iam_member.postgres_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "postgres_password" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "APP_STORE_POSTGRES_PASSWORD"
    }

[1m  # module.enrichment_processor.google_service_account.enrichment_processor[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "enrichment_processor" {
      [32m+[0m[0m account_id   = "enrichment-processor"
      [32m+[0m[0m description  = "Service account for processing enrichment jobs"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Enrichment Processor Job"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.grafana_dashboards.grafana_dashboard.operations[0m will be created
[0m  [32m+[0m[0m resource "grafana_dashboard" "operations" {
      [32m+[0m[0m config_json  = jsonencode(
            {
              [32m+[0m[0m description = "Operational dashboard for Shorted API and frontend"
              [32m+[0m[0m editable    = true
              [32m+[0m[0m panels      = [
                  [32m+[0m[0m {
                      [32m+[0m[0m collapsed = false
                      [32m+[0m[0m gridPos   = {
                          [32m+[0m[0m h = 1
                          [32m+[0m[0m w = 24
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 0
                        }
                      [32m+[0m[0m title     = "API Overview"
                      [32m+[0m[0m type      = "row"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "line"
                                  [32m+[0m[0m fillOpacity = 10
                                  [32m+[0m[0m lineWidth   = 2
                                }
                              [32m+[0m[0m unit   = "reqps"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 12
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 1
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "sum(rate(rpc_server_requests_total{job="shorted-api"}[$__rate_interval])) by (rpc_method)"
                              [32m+[0m[0m legendFormat = "{{ rpc_method }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "RPC Request Rate"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "line"
                                  [32m+[0m[0m fillOpacity = 5
                                  [32m+[0m[0m lineWidth   = 2
                                }
                              [32m+[0m[0m unit   = "ms"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 12
                          [32m+[0m[0m x = 12
                          [32m+[0m[0m y = 1
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "histogram_quantile(0.50, sum(rate(rpc_server_duration_milliseconds_bucket{job="shorted-api"}[$__rate_interval])) by (le))"
                              [32m+[0m[0m legendFormat = "p50"
                              [32m+[0m[0m refId        = "A"
                            },
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "histogram_quantile(0.95, sum(rate(rpc_server_duration_milliseconds_bucket{job="shorted-api"}[$__rate_interval])) by (le))"
                              [32m+[0m[0m legendFormat = "p95"
                              [32m+[0m[0m refId        = "B"
                            },
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "histogram_quantile(0.99, sum(rate(rpc_server_duration_milliseconds_bucket{job="shorted-api"}[$__rate_interval])) by (le))"
                              [32m+[0m[0m legendFormat = "p99"
                              [32m+[0m[0m refId        = "C"
                            },
                        ]
                      [32m+[0m[0m title       = "RPC Duration (p50 / p95 / p99)"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color  = {
                                  [32m+[0m[0m fixedColor = "red"
                                  [32m+[0m[0m mode       = "fixed"
                                }
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "bars"
                                  [32m+[0m[0m fillOpacity = 50
                                  [32m+[0m[0m lineWidth   = 1
                                }
                              [32m+[0m[0m unit   = "reqps"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 9
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "sum(rate(rpc_server_requests_total{job="shorted-api", rpc_connect_status_code!="ok"}[$__rate_interval])) by (rpc_connect_status_code)"
                              [32m+[0m[0m legendFormat = "{{ rpc_connect_status_code }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "RPC Error Rate"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "line"
                                  [32m+[0m[0m fillOpacity = 5
                                  [32m+[0m[0m lineWidth   = 1
                                }
                              [32m+[0m[0m unit   = "ms"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 8
                          [32m+[0m[0m y = 9
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "histogram_quantile(0.95, sum(rate(rpc_server_duration_milliseconds_bucket{job="shorted-api"}[$__rate_interval])) by (le, rpc_method))"
                              [32m+[0m[0m legendFormat = "{{ rpc_method }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "RPC p95 by Method"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color      = {
                                  [32m+[0m[0m mode = "thresholds"
                                }
                              [32m+[0m[0m thresholds = {
                                  [32m+[0m[0m steps = [
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "green"
                                          [32m+[0m[0m value = [90mnull[0m[0m
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "yellow"
                                          [32m+[0m[0m value = 10000
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "red"
                                          [32m+[0m[0m value = 50000
                                        },
                                    ]
                                }
                              [32m+[0m[0m unit       = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 4
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 16
                          [32m+[0m[0m y = 9
                        }
                      [32m+[0m[0m options     = {
                          [32m+[0m[0m colorMode = "background"
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr  = "sum(increase(rpc_server_requests_total{job="shorted-api"}[24h]))"
                              [32m+[0m[0m refId = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Total Requests (24h)"
                      [32m+[0m[0m type        = "stat"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color      = {
                                  [32m+[0m[0m mode = "thresholds"
                                }
                              [32m+[0m[0m thresholds = {
                                  [32m+[0m[0m steps = [
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "green"
                                          [32m+[0m[0m value = [90mnull[0m[0m
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "yellow"
                                          [32m+[0m[0m value = 100
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "red"
                                          [32m+[0m[0m value = 500
                                        },
                                    ]
                                }
                              [32m+[0m[0m unit       = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 4
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 16
                          [32m+[0m[0m y = 13
                        }
                      [32m+[0m[0m options     = {
                          [32m+[0m[0m colorMode = "background"
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr  = "sum(increase(rpc_server_requests_total{job="shorted-api", rpc_connect_status_code!="ok"}[24h]))"
                              [32m+[0m[0m refId = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Errors (24h)"
                      [32m+[0m[0m type        = "stat"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m collapsed = false
                      [32m+[0m[0m gridPos   = {
                          [32m+[0m[0m h = 1
                          [32m+[0m[0m w = 24
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 17
                        }
                      [32m+[0m[0m title     = "Security & Rate Limiting"
                      [32m+[0m[0m type      = "row"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color  = {
                                  [32m+[0m[0m mode = "palette-classic"
                                }
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "bars"
                                  [32m+[0m[0m fillOpacity = 50
                                  [32m+[0m[0m lineWidth   = 1
                                }
                              [32m+[0m[0m unit   = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 18
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "sum(rate(shorted_rate_limit_blocked_total{job="shorted-api"}[$__rate_interval])) by (tier)"
                              [32m+[0m[0m legendFormat = "{{ tier }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Rate Limit Blocks"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color  = {
                                  [32m+[0m[0m mode = "palette-classic"
                                }
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "bars"
                                  [32m+[0m[0m fillOpacity = 50
                                  [32m+[0m[0m lineWidth   = 1
                                }
                              [32m+[0m[0m unit   = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 8
                          [32m+[0m[0m y = 18
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "sum(rate(shorted_scraper_blocked_total{job="shorted-api"}[$__rate_interval])) by (reason)"
                              [32m+[0m[0m legendFormat = "{{ reason }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Scraper / Bot Blocks"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m gridPos    = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 8
                          [32m+[0m[0m x = 16
                          [32m+[0m[0m y = 18
                        }
                      [32m+[0m[0m options    = {
                          [32m+[0m[0m legend        = {
                              [32m+[0m[0m displayMode = "table"
                              [32m+[0m[0m placement   = "right"
                            }
                          [32m+[0m[0m reduceOptions = {
                              [32m+[0m[0m calcs = [
                                  [32m+[0m[0m "sum",
                                ]
                            }
                        }
                      [32m+[0m[0m targets    = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "sum(increase(shorted_auth_method_total{job="shorted-api"}[24h])) by (method)"
                              [32m+[0m[0m legendFormat = "{{ method }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title      = "Auth Methods (24h)"
                      [32m+[0m[0m type       = "piechart"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color      = {
                                  [32m+[0m[0m mode = "thresholds"
                                }
                              [32m+[0m[0m thresholds = {
                                  [32m+[0m[0m steps = [
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "green"
                                          [32m+[0m[0m value = [90mnull[0m[0m
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "yellow"
                                          [32m+[0m[0m value = 50
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "red"
                                          [32m+[0m[0m value = 200
                                        },
                                    ]
                                }
                              [32m+[0m[0m unit       = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 4
                          [32m+[0m[0m w = 6
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 26
                        }
                      [32m+[0m[0m options     = {
                          [32m+[0m[0m colorMode = "background"
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr  = "sum(increase(shorted_rate_limit_blocked_total{job="shorted-api"}[24h]))"
                              [32m+[0m[0m refId = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Rate Limited (24h)"
                      [32m+[0m[0m type        = "stat"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color      = {
                                  [32m+[0m[0m mode = "thresholds"
                                }
                              [32m+[0m[0m thresholds = {
                                  [32m+[0m[0m steps = [
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "green"
                                          [32m+[0m[0m value = [90mnull[0m[0m
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "yellow"
                                          [32m+[0m[0m value = 20
                                        },
                                      [32m+[0m[0m {
                                          [32m+[0m[0m color = "red"
                                          [32m+[0m[0m value = 100
                                        },
                                    ]
                                }
                              [32m+[0m[0m unit       = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 4
                          [32m+[0m[0m w = 6
                          [32m+[0m[0m x = 6
                          [32m+[0m[0m y = 26
                        }
                      [32m+[0m[0m options     = {
                          [32m+[0m[0m colorMode = "background"
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr  = "sum(increase(shorted_scraper_blocked_total{job="shorted-api"}[24h]))"
                              [32m+[0m[0m refId = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Scrapers Blocked (24h)"
                      [32m+[0m[0m type        = "stat"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color = {
                                  [32m+[0m[0m fixedColor = "orange"
                                  [32m+[0m[0m mode       = "fixed"
                                }
                              [32m+[0m[0m unit  = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 4
                          [32m+[0m[0m w = 6
                          [32m+[0m[0m x = 12
                          [32m+[0m[0m y = 26
                        }
                      [32m+[0m[0m options     = {
                          [32m+[0m[0m colorMode = "background"
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr  = "sum(increase(shorted_auth_method_total{job="shorted-api", method="anonymous"}[24h]))"
                              [32m+[0m[0m refId = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Anonymous Requests (24h)"
                      [32m+[0m[0m type        = "stat"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m color = {
                                  [32m+[0m[0m fixedColor = "green"
                                  [32m+[0m[0m mode       = "fixed"
                                }
                              [32m+[0m[0m unit  = "short"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 4
                          [32m+[0m[0m w = 6
                          [32m+[0m[0m x = 18
                          [32m+[0m[0m y = 26
                        }
                      [32m+[0m[0m options     = {
                          [32m+[0m[0m colorMode = "background"
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr  = "sum(increase(shorted_auth_method_total{job="shorted-api", method!="anonymous"}[24h]))"
                              [32m+[0m[0m refId = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Authenticated (24h)"
                      [32m+[0m[0m type        = "stat"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m collapsed = false
                      [32m+[0m[0m gridPos   = {
                          [32m+[0m[0m h = 1
                          [32m+[0m[0m w = 24
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 30
                        }
                      [32m+[0m[0m title     = "Frontend (Next.js)"
                      [32m+[0m[0m type      = "row"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "line"
                                  [32m+[0m[0m fillOpacity = 10
                                  [32m+[0m[0m lineWidth   = 2
                                }
                              [32m+[0m[0m unit   = "ms"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 12
                          [32m+[0m[0m x = 0
                          [32m+[0m[0m y = 31
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "histogram_quantile(0.95, sum(rate(http_server_duration_milliseconds_bucket{job="shorted-web"}[$__rate_interval])) by (le, http_route))"
                              [32m+[0m[0m legendFormat = "{{ http_route }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Server Action Duration (p95)"
                      [32m+[0m[0m type        = "timeseries"
                    },
                  [32m+[0m[0m {
                      [32m+[0m[0m datasource  = {
                          [32m+[0m[0m type = "prometheus"
                          [32m+[0m[0m uid  = "grafanacloud-prom"
                        }
                      [32m+[0m[0m fieldConfig = {
                          [32m+[0m[0m defaults = {
                              [32m+[0m[0m custom = {
                                  [32m+[0m[0m drawStyle   = "line"
                                  [32m+[0m[0m fillOpacity = 10
                                  [32m+[0m[0m lineWidth   = 2
                                }
                              [32m+[0m[0m unit   = "reqps"
                            }
                        }
                      [32m+[0m[0m gridPos     = {
                          [32m+[0m[0m h = 8
                          [32m+[0m[0m w = 12
                          [32m+[0m[0m x = 12
                          [32m+[0m[0m y = 31
                        }
                      [32m+[0m[0m targets     = [
                          [32m+[0m[0m {
                              [32m+[0m[0m expr         = "sum(rate(http_server_duration_milliseconds_count{job="shorted-web"}[$__rate_interval])) by (http_route)"
                              [32m+[0m[0m legendFormat = "{{ http_route }}"
                              [32m+[0m[0m refId        = "A"
                            },
                        ]
                      [32m+[0m[0m title       = "Frontend Request Rate"
                      [32m+[0m[0m type        = "timeseries"
                    },
                ]
              [32m+[0m[0m refresh     = "30s"
              [32m+[0m[0m tags        = [
                  [32m+[0m[0m "shorted",
                  [32m+[0m[0m "operations",
                ]
              [32m+[0m[0m templating  = {
                  [32m+[0m[0m list = [
                      [32m+[0m[0m {
                          [32m+[0m[0m current = {
                              [32m+[0m[0m text  = "shorted-api"
                              [32m+[0m[0m value = "shorted-api"
                            }
                          [32m+[0m[0m name    = "service"
                          [32m+[0m[0m options = [
                              [32m+[0m[0m {
                                  [32m+[0m[0m selected = true
                                  [32m+[0m[0m text     = "shorted-api"
                                  [32m+[0m[0m value    = "shorted-api"
                                },
                              [32m+[0m[0m {
                                  [32m+[0m[0m selected = false
                                  [32m+[0m[0m text     = "shorted-web"
                                  [32m+[0m[0m value    = "shorted-web"
                                },
                            ]
                          [32m+[0m[0m type    = "custom"
                        },
                    ]
                }
              [32m+[0m[0m time        = {
                  [32m+[0m[0m from = "now-6h"
                  [32m+[0m[0m to   = "now"
                }
              [32m+[0m[0m timezone    = "browser"
              [32m+[0m[0m title       = "Shorted - Operations"
            }
        )
      [32m+[0m[0m dashboard_id = (known after apply)
      [32m+[0m[0m folder       = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m overwrite    = true
      [32m+[0m[0m uid          = (known after apply)
      [32m+[0m[0m url          = (known after apply)
      [32m+[0m[0m version      = (known after apply)
    }

[1m  # module.grafana_dashboards.grafana_folder.shorted[0m will be created
[0m  [32m+[0m[0m resource "grafana_folder" "shorted" {
      [32m+[0m[0m id                           = (known after apply)
      [32m+[0m[0m prevent_destroy_if_not_empty = false
      [32m+[0m[0m title                        = "Shorted"
      [32m+[0m[0m uid                          = (known after apply)
      [32m+[0m[0m url                          = (known after apply)
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_job.asx_discovery[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job" "asx_discovery" {
      [32m+[0m[0m conditions               = (known after apply)
      [32m+[0m[0m create_time              = (known after apply)
      [32m+[0m[0m creator                  = (known after apply)
      [32m+[0m[0m delete_time              = (known after apply)
      [32m+[0m[0m effective_annotations    = (known after apply)
      [32m+[0m[0m effective_labels         = (known after apply)
      [32m+[0m[0m etag                     = (known after apply)
      [32m+[0m[0m execution_count          = (known after apply)
      [32m+[0m[0m expire_time              = (known after apply)
      [32m+[0m[0m generation               = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m last_modifier            = (known after apply)
      [32m+[0m[0m latest_created_execution = (known after apply)
      [32m+[0m[0m launch_stage             = (known after apply)
      [32m+[0m[0m location                 = "australia-southeast2"
      [32m+[0m[0m name                     = "asx-discovery"
      [32m+[0m[0m observed_generation      = (known after apply)
      [32m+[0m[0m project                  = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling              = (known after apply)
      [32m+[0m[0m terminal_condition       = (known after apply)
      [32m+[0m[0m terraform_labels         = (known after apply)
      [32m+[0m[0m uid                      = (known after apply)
      [32m+[0m[0m update_time              = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m parallelism = (known after apply)
          [32m+[0m[0m task_count  = (known after apply)

          [32m+[0m[0m template {
              [32m+[0m[0m execution_environment = (known after apply)
              [32m+[0m[0m max_retries           = 3
              [32m+[0m[0m service_account       = (known after apply)
              [32m+[0m[0m timeout               = (known after apply)

              [32m+[0m[0m containers {
                  [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/asx-discovery:pr-73"

                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "GCS_BUCKET_NAME"
                      [32m+[0m[0m value = "shorted-short-selling-data"
                    }

                  [32m+[0m[0m resources {
                      [32m+[0m[0m limits = {
                          [32m+[0m[0m "cpu"    = "1"
                          [32m+[0m[0m "memory" = "2Gi"
                        }
                    }
                }
            }
        }
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_job_iam_member.asx_discovery_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job_iam_member" "asx_discovery_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "asx-discovery"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_service.market_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "market_data_sync" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "module"      = "market-discovery-sync"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "module"      = "market-discovery-sync"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "market-data-sync"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "dev"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "module"      = "market-discovery-sync"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "600s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/market-data-sync:pr-73"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "dev"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "DATABASE_URL"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "DATABASE_URL"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCS_BUCKET_NAME"
                  [32m+[0m[0m value = "shorted-short-selling-data"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "PRIORITY_STOCK_COUNT"
                  [32m+[0m[0m value = "100"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALPHA_VANTAGE_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALPHA_VANTAGE_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 10

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 8080
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "1"
                      [32m+[0m[0m "memory" = "2Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 6
                  [32m+[0m[0m initial_delay_seconds = 5
                  [32m+[0m[0m period_seconds        = 5
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 10
              [32m+[0m[0m min_instance_count = 0
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_service_iam_member.market_data_sync_public[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "market_data_sync_public" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "market-data-sync"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.market_discovery_sync.google_cloud_run_v2_service_iam_member.market_data_sync_scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "market_data_sync_scheduler_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "market-data-sync"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.market_discovery_sync.google_cloud_scheduler_job.asx_discovery_weekly[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "asx_discovery_weekly" {
      [32m+[0m[0m attempt_deadline = "320s"
      [32m+[0m[0m description      = "Download ASX company directory CSV weekly"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "asx-discovery-weekly"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 12 * * 0"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = "https://australia-southeast2-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/shorted-dev-aba5688f/jobs/asx-discovery:run"

          [32m+[0m[0m oauth_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }
    }

[1m  # module.market_discovery_sync.google_cloud_scheduler_job.market_data_sync_daily[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "market_data_sync_daily" {
      [32m+[0m[0m attempt_deadline = "1800s"
      [32m+[0m[0m description      = "Sync stock prices daily via HTTP API"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "market-data-sync-daily"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 10 * * 1-5"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m headers     = {
              [32m+[0m[0m "Content-Type" = "application/json"
            }
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = (known after apply)

          [32m+[0m[0m oidc_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }
    }

[1m  # module.market_discovery_sync.google_secret_manager_secret_iam_member.market_data_sync_av[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "market_data_sync_av" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALPHA_VANTAGE_API_KEY"
    }

[1m  # module.market_discovery_sync.google_secret_manager_secret_iam_member.market_data_sync_db[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "market_data_sync_db" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.market_discovery_sync.google_service_account.asx_discovery[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "asx_discovery" {
      [32m+[0m[0m account_id   = "asx-discovery"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "ASX Discovery Job SA"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_service_account.market_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "market_data_sync" {
      [32m+[0m[0m account_id   = "market-data-sync"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Market Data Sync Service SA"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_service_account.scheduler[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "scheduler" {
      [32m+[0m[0m account_id   = "market-jobs-scheduler"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Market Jobs Scheduler SA"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.market_discovery_sync.google_storage_bucket_iam_member.asx_discovery_gcs[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "asx_discovery_gcs" {
      [32m+[0m[0m bucket = "shorted-short-selling-data"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.market_discovery_sync.google_storage_bucket_iam_member.market_data_sync_gcs[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "market_data_sync_gcs" {
      [32m+[0m[0m bucket = "shorted-short-selling-data"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.short_data_sync.google_cloud_run_v2_job.short_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job" "short_data_sync" {
      [32m+[0m[0m conditions               = (known after apply)
      [32m+[0m[0m create_time              = (known after apply)
      [32m+[0m[0m creator                  = (known after apply)
      [32m+[0m[0m delete_time              = (known after apply)
      [32m+[0m[0m effective_annotations    = (known after apply)
      [32m+[0m[0m effective_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "short-data-sync"
        }
      [32m+[0m[0m etag                     = (known after apply)
      [32m+[0m[0m execution_count          = (known after apply)
      [32m+[0m[0m expire_time              = (known after apply)
      [32m+[0m[0m generation               = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m labels                   = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "short-data-sync"
        }
      [32m+[0m[0m last_modifier            = (known after apply)
      [32m+[0m[0m latest_created_execution = (known after apply)
      [32m+[0m[0m launch_stage             = (known after apply)
      [32m+[0m[0m location                 = "australia-southeast2"
      [32m+[0m[0m name                     = "shorts-data-sync"
      [32m+[0m[0m observed_generation      = (known after apply)
      [32m+[0m[0m project                  = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling              = (known after apply)
      [32m+[0m[0m terminal_condition       = (known after apply)
      [32m+[0m[0m terraform_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "short-data-sync"
        }
      [32m+[0m[0m uid                      = (known after apply)
      [32m+[0m[0m update_time              = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m parallelism = (known after apply)
          [32m+[0m[0m task_count  = 1

          [32m+[0m[0m template {
              [32m+[0m[0m execution_environment = (known after apply)
              [32m+[0m[0m max_retries           = 3
              [32m+[0m[0m service_account       = (known after apply)
              [32m+[0m[0m timeout               = "14400s"

              [32m+[0m[0m containers {
                  [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/short-data-sync:pr-73"

                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "ENVIRONMENT"
                      [32m+[0m[0m value = "production"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "GCP_PROJECT"
                      [32m+[0m[0m value = "shorted-dev-aba5688f"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "DATABASE_URL"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "DATABASE_URL"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }

                  [32m+[0m[0m resources {
                      [32m+[0m[0m limits = {
                          [32m+[0m[0m "cpu"    = "2"
                          [32m+[0m[0m "memory" = "4Gi"
                        }
                    }
                }
            }
        }
    }

[1m  # module.short_data_sync.google_cloud_run_v2_job_iam_member.scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job_iam_member" "scheduler_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "shorts-data-sync"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.short_data_sync.google_cloud_scheduler_job.daily_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "daily_sync" {
      [32m+[0m[0m attempt_deadline = "1800s"
      [32m+[0m[0m description      = "Daily sync of ASIC short selling data"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "shorts-data-sync-daily"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 10 * * *"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = "https://australia-southeast2-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/shorted-dev-aba5688f/jobs/shorts-data-sync:run"

          [32m+[0m[0m oauth_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "3600s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "7200s"
          [32m+[0m[0m min_backoff_duration = "10s"
          [32m+[0m[0m retry_count          = 2
        }
    }

[1m  # module.short_data_sync.google_secret_manager_secret_iam_member.database_url[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "database_url" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.short_data_sync.google_service_account.scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "scheduler_invoker" {
      [32m+[0m[0m account_id   = "shorts-data-sync-scheduler"
      [32m+[0m[0m description  = "Service account for Cloud Scheduler to invoke short data sync job"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Short Data Sync Scheduler"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.short_data_sync.google_service_account.short_data_sync[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "short_data_sync" {
      [32m+[0m[0m account_id   = "shorts-data-sync"
      [32m+[0m[0m description  = "Service account for syncing ASIC short selling data"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Short Data Sync Job"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.short_data_sync.google_storage_bucket.short_selling_data[0m will be imported
[0m    resource "google_storage_bucket" "short_selling_data" {
        default_event_based_hold    = false
        effective_labels            = {}
        enable_object_retention     = false
        force_destroy               = false
        id                          = "shorted-short-selling-data"
        labels                      = {}
        location                    = "US"
        name                        = "shorted-short-selling-data"
        project                     = "shorted-dev-aba5688f"
        project_number              = 234770780438
        public_access_prevention    = "enforced"
        requester_pays              = false
        rpo                         = "DEFAULT"
        self_link                   = "https://www.googleapis.com/storage/v1/b/shorted-short-selling-data"
        storage_class               = "STANDARD"
        terraform_labels            = {}
        uniform_bucket_level_access = true
        url                         = "gs://shorted-short-selling-data"

        autoclass {
            enabled                = true
            terminal_storage_class = "NEARLINE"
        }

        lifecycle_rule {
            action {
                type = "Delete"
            }
            condition {
                age                                     = 365
                days_since_custom_time                  = 0
                days_since_noncurrent_time              = 0
                matches_prefix                          = []
                matches_storage_class                   = []
                matches_suffix                          = []
                no_age                                  = false
                num_newer_versions                      = 0
                send_age_if_zero                        = true
                send_days_since_custom_time_if_zero     = false
                send_days_since_noncurrent_time_if_zero = false
                send_num_newer_versions_if_zero         = false
                with_state                              = "ANY"
            }
        }

        soft_delete_policy {
            effective_time             = "2024-04-21T08:29:17.092Z"
            retention_duration_seconds = 604800
        }

        versioning {
            enabled = true
        }
    }

[1m  # module.short_data_sync.google_storage_bucket_iam_member.short_data_sync_bucket[0m will be created
[0m  [32m+[0m[0m resource "google_storage_bucket_iam_member" "short_data_sync_bucket" {
      [32m+[0m[0m bucket = "shorted-short-selling-data"
      [32m+[0m[0m etag   = (known after apply)
      [32m+[0m[0m id     = (known after apply)
      [32m+[0m[0m member = (known after apply)
      [32m+[0m[0m role   = "roles/storage.objectAdmin"
    }

[1m  # module.shorts_api.google_cloud_run_v2_service.shorts_api[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "shorts_api" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "shorts-api"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "shorts-api"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "shorts"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "shorts-api"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "300s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/shorts:pr-73"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "production"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT_ID"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_ADDRESS"
                  [32m+[0m[0m value = "aws-0-ap-southeast-2.pooler.supabase.com:6543"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_DATABASE"
                  [32m+[0m[0m value = "postgres"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "APP_STORE_POSTGRES_USERNAME"
                  [32m+[0m[0m value = "postgres.xivfykscsdagwsreyqgf"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "APP_STORE_POSTGRES_PASSWORD"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "APP_STORE_POSTGRES_PASSWORD"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALGOLIA_APP_ID"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALGOLIA_APP_ID"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALGOLIA_SEARCH_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALGOLIA_SEARCH_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ALGOLIA_INDEX"
                  [32m+[0m[0m value = "stocks"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "OPENAI_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "OPENAI_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "INTERNAL_SERVICE_SECRET"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "INTERNAL_SERVICE_SECRET"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "TOKEN_SECRET"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "TOKEN_SECRET"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "OTEL_EXPORTER_OTLP_ENDPOINT"
                  [32m+[0m[0m value = "https://otlp-gateway-prod-au-southeast-1.grafana.net/otlp"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "OTEL_EXPORTER_OTLP_PROTOCOL"
                  [32m+[0m[0m value = "http/protobuf"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "OTEL_EXPORTER_OTLP_HEADERS"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "OTEL_EXPORTER_OTLP_HEADERS"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 9091
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 9091
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "2"
                      [32m+[0m[0m "memory" = "2Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 5
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 3

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 9091
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 100
              [32m+[0m[0m min_instance_count = 0
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.shorts_api.google_cloud_run_v2_service_iam_member.public_access[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "public_access" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "shorts"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.shorts_api.google_pubsub_topic_iam_member.enrichment_jobs_publisher[0m will be created
[0m  [32m+[0m[0m resource "google_pubsub_topic_iam_member" "enrichment_jobs_publisher" {
      [32m+[0m[0m etag    = (known after apply)
      [32m+[0m[0m id      = (known after apply)
      [32m+[0m[0m member  = (known after apply)
      [32m+[0m[0m project = "shorted-dev-aba5688f"
      [32m+[0m[0m role    = "roles/pubsub.publisher"
      [32m+[0m[0m topic   = "enrichment-jobs"
    }

[1m  # module.shorts_api.google_secret_manager_secret.otel_headers[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret" "otel_headers" {
      [32m+[0m[0m create_time           = (known after apply)
      [32m+[0m[0m effective_annotations = (known after apply)
      [32m+[0m[0m effective_labels      = (known after apply)
      [32m+[0m[0m expire_time           = (known after apply)
      [32m+[0m[0m id                    = (known after apply)
      [32m+[0m[0m name                  = (known after apply)
      [32m+[0m[0m project               = "shorted-dev-aba5688f"
      [32m+[0m[0m secret_id             = "OTEL_EXPORTER_OTLP_HEADERS"
      [32m+[0m[0m terraform_labels      = (known after apply)

      [32m+[0m[0m replication {
          [32m+[0m[0m auto {
            }
        }
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.algolia_app_id[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "algolia_app_id" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALGOLIA_APP_ID"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.algolia_search_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "algolia_search_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALGOLIA_SEARCH_KEY"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.internal_service_secret[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "internal_service_secret" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "INTERNAL_SERVICE_SECRET"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.openai_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "openai_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "OPENAI_API_KEY"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.otel_headers[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "otel_headers" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "OTEL_EXPORTER_OTLP_HEADERS"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.postgres_password[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "postgres_password" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "APP_STORE_POSTGRES_PASSWORD"
    }

[1m  # module.shorts_api.google_secret_manager_secret_iam_member.token_secret[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "token_secret" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "TOKEN_SECRET"
    }

[1m  # module.shorts_api.google_service_account.shorts_api[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "shorts_api" {
      [32m+[0m[0m account_id   = "shorts"
      [32m+[0m[0m description  = "Service account for the Shorts API"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Shorts API Service"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.stock_price_ingestion.google_cloud_run_v2_service.stock_price_ingestion[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service" "stock_price_ingestion" {
      [32m+[0m[0m conditions              = (known after apply)
      [32m+[0m[0m create_time             = (known after apply)
      [32m+[0m[0m creator                 = (known after apply)
      [32m+[0m[0m delete_time             = (known after apply)
      [32m+[0m[0m effective_annotations   = (known after apply)
      [32m+[0m[0m effective_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "stock-price-ingestion"
        }
      [32m+[0m[0m etag                    = (known after apply)
      [32m+[0m[0m expire_time             = (known after apply)
      [32m+[0m[0m generation              = (known after apply)
      [32m+[0m[0m id                      = (known after apply)
      [32m+[0m[0m ingress                 = (known after apply)
      [32m+[0m[0m labels                  = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "stock-price-ingestion"
        }
      [32m+[0m[0m last_modifier           = (known after apply)
      [32m+[0m[0m latest_created_revision = (known after apply)
      [32m+[0m[0m latest_ready_revision   = (known after apply)
      [32m+[0m[0m launch_stage            = (known after apply)
      [32m+[0m[0m location                = "australia-southeast2"
      [32m+[0m[0m name                    = "stock-price-ingestion"
      [32m+[0m[0m observed_generation     = (known after apply)
      [32m+[0m[0m project                 = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling             = (known after apply)
      [32m+[0m[0m terminal_condition      = (known after apply)
      [32m+[0m[0m terraform_labels        = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "stock-price-ingestion"
        }
      [32m+[0m[0m traffic_statuses        = (known after apply)
      [32m+[0m[0m uid                     = (known after apply)
      [32m+[0m[0m update_time             = (known after apply)
      [32m+[0m[0m uri                     = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m max_instance_request_concurrency = (known after apply)
          [32m+[0m[0m service_account                  = (known after apply)
          [32m+[0m[0m timeout                          = "600s"

          [32m+[0m[0m containers {
              [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/stock-price-ingestion:pr-73"

              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "ENVIRONMENT"
                  [32m+[0m[0m value = "production"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name  = "GCP_PROJECT"
                  [32m+[0m[0m value = "shorted-dev-aba5688f"
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "DATABASE_URL"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "DATABASE_URL"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }
              [32m+[0m[0m env {
                  [32m+[0m[0m name = "ALPHA_VANTAGE_API_KEY"

                  [32m+[0m[0m value_source {
                      [32m+[0m[0m secret_key_ref {
                          [32m+[0m[0m secret  = "ALPHA_VANTAGE_API_KEY"
                          [32m+[0m[0m version = "latest"
                        }
                    }
                }

              [32m+[0m[0m liveness_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 30
                  [32m+[0m[0m period_seconds        = 30
                  [32m+[0m[0m timeout_seconds       = 10

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }

              [32m+[0m[0m ports {
                  [32m+[0m[0m container_port = 8080
                  [32m+[0m[0m name           = "http1"
                }

              [32m+[0m[0m resources {
                  [32m+[0m[0m cpu_idle          = false
                  [32m+[0m[0m limits            = {
                      [32m+[0m[0m "cpu"    = "1"
                      [32m+[0m[0m "memory" = "1Gi"
                    }
                  [32m+[0m[0m startup_cpu_boost = true
                }

              [32m+[0m[0m startup_probe {
                  [32m+[0m[0m failure_threshold     = 3
                  [32m+[0m[0m initial_delay_seconds = 10
                  [32m+[0m[0m period_seconds        = 10
                  [32m+[0m[0m timeout_seconds       = 5

                  [32m+[0m[0m http_get {
                      [32m+[0m[0m path = "/health"
                      [32m+[0m[0m port = 8080
                    }
                }
            }

          [32m+[0m[0m scaling {
              [32m+[0m[0m max_instance_count = 10
              [32m+[0m[0m min_instance_count = 0
            }
        }

      [32m+[0m[0m traffic {
          [32m+[0m[0m percent = 100
          [32m+[0m[0m type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

[1m  # module.stock_price_ingestion.google_cloud_run_v2_service_iam_member.invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_service_iam_member" "invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = "allUsers"
      [32m+[0m[0m name     = "stock-price-ingestion"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.stock_price_ingestion.google_cloud_scheduler_job.daily_sync[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "daily_sync" {
      [32m+[0m[0m attempt_deadline = "600s"
      [32m+[0m[0m description      = "Daily sync of ASX stock prices from Yahoo Finance (after market close)"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "stock-price-daily-sync"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 8 * * 1-5"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m body        = "e30="
          [32m+[0m[0m headers     = {
              [32m+[0m[0m "Content-Type" = "application/json"
            }
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = (known after apply)

          [32m+[0m[0m oidc_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "3600s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "3600s"
          [32m+[0m[0m min_backoff_duration = "5s"
          [32m+[0m[0m retry_count          = 3
        }
    }

[1m  # module.stock_price_ingestion.google_cloud_scheduler_job.weekly_backfill[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "weekly_backfill" {
      [32m+[0m[0m attempt_deadline = "1800s"
      [32m+[0m[0m description      = "Weekly comprehensive sync of stock prices (7-day backfill)"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "stock-price-weekly-sync"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 10 * * 0"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m body        = "eyJkYXlzX2JhY2siOjcsIm1vZGUiOiJiYWNrZmlsbCJ9"
          [32m+[0m[0m headers     = {
              [32m+[0m[0m "Content-Type" = "application/json"
            }
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = (known after apply)

          [32m+[0m[0m oidc_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "7200s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "7200s"
          [32m+[0m[0m min_backoff_duration = "10s"
          [32m+[0m[0m retry_count          = 2
        }
    }

[1m  # module.stock_price_ingestion.google_secret_manager_secret_iam_member.alpha_vantage_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "alpha_vantage_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "ALPHA_VANTAGE_API_KEY"
    }

[1m  # module.stock_price_ingestion.google_secret_manager_secret_iam_member.database_url[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "database_url" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.stock_price_ingestion.google_service_account.stock_price_ingestion[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "stock_price_ingestion" {
      [32m+[0m[0m account_id   = "stock-price-ingestion"
      [32m+[0m[0m description  = "Service account for stock price data ingestion from Alpha Vantage and Yahoo Finance"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Stock Price Ingestion Service"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.weekly_report_generator.google_cloud_run_v2_job.weekly_report_generator[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job" "weekly_report_generator" {
      [32m+[0m[0m conditions               = (known after apply)
      [32m+[0m[0m create_time              = (known after apply)
      [32m+[0m[0m creator                  = (known after apply)
      [32m+[0m[0m delete_time              = (known after apply)
      [32m+[0m[0m effective_annotations    = (known after apply)
      [32m+[0m[0m effective_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "weekly-report-generator"
        }
      [32m+[0m[0m etag                     = (known after apply)
      [32m+[0m[0m execution_count          = (known after apply)
      [32m+[0m[0m expire_time              = (known after apply)
      [32m+[0m[0m generation               = (known after apply)
      [32m+[0m[0m id                       = (known after apply)
      [32m+[0m[0m labels                   = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "weekly-report-generator"
        }
      [32m+[0m[0m last_modifier            = (known after apply)
      [32m+[0m[0m latest_created_execution = (known after apply)
      [32m+[0m[0m launch_stage             = (known after apply)
      [32m+[0m[0m location                 = "australia-southeast2"
      [32m+[0m[0m name                     = "weekly-report-generator"
      [32m+[0m[0m observed_generation      = (known after apply)
      [32m+[0m[0m project                  = "shorted-dev-aba5688f"
      [32m+[0m[0m reconciling              = (known after apply)
      [32m+[0m[0m terminal_condition       = (known after apply)
      [32m+[0m[0m terraform_labels         = {
          [32m+[0m[0m "environment" = "production"
          [32m+[0m[0m "managed_by"  = "terraform"
          [32m+[0m[0m "service"     = "weekly-report-generator"
        }
      [32m+[0m[0m uid                      = (known after apply)
      [32m+[0m[0m update_time              = (known after apply)

      [32m+[0m[0m template {
          [32m+[0m[0m parallelism = (known after apply)
          [32m+[0m[0m task_count  = 1

          [32m+[0m[0m template {
              [32m+[0m[0m execution_environment = (known after apply)
              [32m+[0m[0m max_retries           = 2
              [32m+[0m[0m service_account       = (known after apply)
              [32m+[0m[0m timeout               = "900s"

              [32m+[0m[0m containers {
                  [32m+[0m[0m image = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted/weekly-report-generator:latest"

                  [32m+[0m[0m env {
                      [32m+[0m[0m name  = "ENVIRONMENT"
                      [32m+[0m[0m value = "production"
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "DATABASE_URL"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "DATABASE_URL"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "OPENAI_API_KEY"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "OPENAI_API_KEY"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }
                  [32m+[0m[0m env {
                      [32m+[0m[0m name = "GEMINI_API_KEY"

                      [32m+[0m[0m value_source {
                          [32m+[0m[0m secret_key_ref {
                              [32m+[0m[0m secret  = "GEMINI_API_KEY"
                              [32m+[0m[0m version = "latest"
                            }
                        }
                    }

                  [32m+[0m[0m resources {
                      [32m+[0m[0m limits = {
                          [32m+[0m[0m "cpu"    = "1"
                          [32m+[0m[0m "memory" = "2Gi"
                        }
                    }
                }
            }
        }
    }

[1m  # module.weekly_report_generator.google_cloud_run_v2_job_iam_member.scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_run_v2_job_iam_member" "scheduler_invoker" {
      [32m+[0m[0m etag     = (known after apply)
      [32m+[0m[0m id       = (known after apply)
      [32m+[0m[0m location = "australia-southeast2"
      [32m+[0m[0m member   = (known after apply)
      [32m+[0m[0m name     = "weekly-report-generator"
      [32m+[0m[0m project  = "shorted-dev-aba5688f"
      [32m+[0m[0m role     = "roles/run.invoker"
    }

[1m  # module.weekly_report_generator.google_cloud_scheduler_job.weekly_report[0m will be created
[0m  [32m+[0m[0m resource "google_cloud_scheduler_job" "weekly_report" {
      [32m+[0m[0m attempt_deadline = "1800s"
      [32m+[0m[0m description      = "Weekly generation of short selling report with LLM narrative"
      [32m+[0m[0m id               = (known after apply)
      [32m+[0m[0m name             = "weekly-report-generator-weekly"
      [32m+[0m[0m paused           = (known after apply)
      [32m+[0m[0m project          = "shorted-dev-aba5688f"
      [32m+[0m[0m region           = "australia-southeast1"
      [32m+[0m[0m schedule         = "0 11 * * 5"
      [32m+[0m[0m state            = (known after apply)
      [32m+[0m[0m time_zone        = "UTC"

      [32m+[0m[0m http_target {
          [32m+[0m[0m http_method = "POST"
          [32m+[0m[0m uri         = "https://australia-southeast2-run.googleapis.com/apis/run.googleapis.com/v1/namespaces/shorted-dev-aba5688f/jobs/weekly-report-generator:run"

          [32m+[0m[0m oauth_token {
              [32m+[0m[0m service_account_email = (known after apply)
            }
        }

      [32m+[0m[0m retry_config {
          [32m+[0m[0m max_backoff_duration = "1800s"
          [32m+[0m[0m max_doublings        = (known after apply)
          [32m+[0m[0m max_retry_duration   = "3600s"
          [32m+[0m[0m min_backoff_duration = "10s"
          [32m+[0m[0m retry_count          = 2
        }
    }

[1m  # module.weekly_report_generator.google_secret_manager_secret_iam_member.database_url[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "database_url" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "DATABASE_URL"
    }

[1m  # module.weekly_report_generator.google_secret_manager_secret_iam_member.gemini_api_key[0][0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "gemini_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "GEMINI_API_KEY"
    }

[1m  # module.weekly_report_generator.google_secret_manager_secret_iam_member.openai_api_key[0m will be created
[0m  [32m+[0m[0m resource "google_secret_manager_secret_iam_member" "openai_api_key" {
      [32m+[0m[0m etag      = (known after apply)
      [32m+[0m[0m id        = (known after apply)
      [32m+[0m[0m member    = (known after apply)
      [32m+[0m[0m project   = "shorted-dev-aba5688f"
      [32m+[0m[0m role      = "roles/secretmanager.secretAccessor"
      [32m+[0m[0m secret_id = "OPENAI_API_KEY"
    }

[1m  # module.weekly_report_generator.google_service_account.scheduler_invoker[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "scheduler_invoker" {
      [32m+[0m[0m account_id   = "weekly-report-generator-sched"
      [32m+[0m[0m description  = "Service account for Cloud Scheduler to invoke weekly report generator"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Weekly Report Generator Scheduler"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1m  # module.weekly_report_generator.google_service_account.weekly_report_generator[0m will be created
[0m  [32m+[0m[0m resource "google_service_account" "weekly_report_generator" {
      [32m+[0m[0m account_id   = "weekly-report-generator"
      [32m+[0m[0m description  = "Service account for generating weekly short selling reports"
      [32m+[0m[0m disabled     = false
      [32m+[0m[0m display_name = "Weekly Report Generator Job"
      [32m+[0m[0m email        = (known after apply)
      [32m+[0m[0m id           = (known after apply)
      [32m+[0m[0m member       = (known after apply)
      [32m+[0m[0m name         = (known after apply)
      [32m+[0m[0m project      = "shorted-dev-aba5688f"
      [32m+[0m[0m unique_id    = (known after apply)
    }

[1mPlan:[0m 2 to import, 66 to add, 1 to change, 0 to destroy.
[0m
Changes to Outputs:
  [32m+[0m[0m artifact_registry_repository          = "australia-southeast2-docker.pkg.dev/shorted-dev-aba5688f/shorted"
  [32m+[0m[0m short_data_sync_bucket                = "shorted-short-selling-data"
  [32m+[0m[0m short_data_sync_job_name              = "shorts-data-sync"
  [32m+[0m[0m short_data_sync_scheduler_job         = "shorts-data-sync-daily"
  [32m+[0m[0m shorts_api_service_account            = (known after apply)
  [32m+[0m[0m shorts_api_url                        = (known after apply)
  [32m+[0m[0m stock_price_daily_sync_job            = "stock-price-daily-sync"
  [32m+[0m[0m stock_price_ingestion_service_account = (known after apply)
  [32m+[0m[0m stock_price_ingestion_url             = (known after apply)
  [32m+[0m[0m stock_price_weekly_backfill_job       = "stock-price-weekly-sync"
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Environment: dev*
*Project: shorted-dev-aba5688f*
*Image Tag: pr-73*
